app/views/shared/_friendship_status.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
            <% if current_user %>
              <%= User.find(friendship.user_id).name %>