app/helpers/application_helper.rb

SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1 AND "likes"."user_id" = $2 LIMIT $3  [["post_id", 1], ["user_id", 1], ["LIMIT", 1]]
---
  def like_or_dislike_btn(post)
    like = Like.find_by(post: post, user: current_user)