app/helpers/friendships_helper.rb

SELECT "friendships".* FROM "friendships" WHERE "friendships"."friend_id" = $1 AND "friendships"."confirmed" = $2  [["friend_id", 1], ["confirmed", false]]
---
  def cancel_request(user)
    cancel = ''
    return unless signed_in? && !Friendship.confirmed_record?(current_user.id, user.id) && current_user != user

    user.pending_friendships.each do |friendship|

SELECT "friendships".* FROM "friendships" WHERE "friendships"."friend_id" = $1 AND "friendships"."confirmed" = $2  [["friend_id", 1], ["confirmed", false]]
---
  def reject_response(user)
    reject = ''
    if signed_in? &&
       !Friendship.confirmed_record?(current_user.id, user.id) && current_user == user
      user.pending_friendships.each do |friendship|

SELECT "friendships".* FROM "friendships" WHERE "friendships"."friend_id" = $1 AND "friendships"."confirmed" = $2  [["friend_id", 1], ["confirmed", false]]
---
  def accept_response(user)
    accept = ''
    if signed_in? &&
       !Friendship.confirmed_record?(current_user.id, user.id) && current_user == user
      user.pending_friendships.each do |friendship|

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def display_name(user)
    name = ''
    if signed_in? &&
       !Friendship.confirmed_record?(current_user.id, user.id) &&
       current_user == user
      user.pending_friendships.each do |friendship|
        name = User.find(friendship.user_id).name if current_user