app/helpers/user_posts_helper.rb

  def render_user_posts
    if signed_in? && Friendship.reacted?(current_user.id, @user.id)
      render @posts
    elsif signed_in? && @user == current_user
      render @user.posts.order(created_at: :desc)
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY "posts"."created_at" DESC  [["user_id", 1]]