app/views/posts/_post.html.erb

  <div class='post-comments-section'>
    <% post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]