app/controllers/friendships_controller.rb

INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["friend_id", 2], ["created_at", "2020-07-30 10:11:11.534569"], ["updated_at", "2020-07-30 10:11:11.534569"]]
---
  def create
    id1 = params[:ids][:id1]
    id2 = params[:ids][:id2]
    @friendship = Friendship.new(user_id: id1, friend_id: id2)
    @friendship.save

SELECT "friendships".* FROM "friendships" WHERE "friendships"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1 AND "friendships"."friend_id" = $2 LIMIT $3  [["user_id", 2], ["friend_id", 1], ["LIMIT", 1]]
DELETE FROM "friendships" WHERE "friendships"."id" = $1  [["id", 49]]
DELETE FROM "friendships" WHERE "friendships"."id" = $1  [["id", 55]]
---
  def destroy
    friendship = Friendship.find(params[:friendship_id])
    user = friendship.user_id
    friend = friendship.friend_id
    if friendship2 = Friendship.find_by(user_id:friend, friend_id:user)
     friendship2.destroy
    end
    friendship.destroy

SELECT "friendships".* FROM "friendships" WHERE "friendships"."id" = $1 LIMIT $2  [["id", 57], ["LIMIT", 1]]
UPDATE "friendships" SET "confirmed" = $1, "updated_at" = $2 WHERE "friendships"."id" = $3  [["confirmed", true], ["updated_at", "2020-07-30 15:53:48.199934"], ["id", 57]]
INSERT INTO "friendships" ("user_id", "friend_id", "confirmed", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["friend_id", 1], ["confirmed", true], ["created_at", "2020-07-30 15:53:48.361042"], ["updated_at", "2020-07-30 15:53:48.361042"]]
---
  def update
    friendship = Friendship.find(params[:friendship_id])
    p current_user
    if friendship.update(confirmed: true)
      friendship = Friendship.new(user_id: friendship.friend_id, friend_id: friendship.user_id, confirmed: true)
      friendship.save