app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("user_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["content", "This is a test post"], ["created_at", "2020-07-31 14:15:54.523178"], ["updated_at", "2020-07-31 14:15:54.523178"]]

  def timeline_posts
    @user_posts = current_user.posts.ordered_by_most_recent
    @friend_posts = Post.ordered_by_most_recent.where(user_id: current_user.friends)
    @inverse_posts = Post.ordered_by_most_recent.where(user_id: current_user.users)
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY "posts"."created_at" DESC  [["user_id", 2]]