app/models/friendship.rb

  def self.request(user, friend)
    unless user == friend or Friendship.exists?(user, friend)
---
SELECT 1 AS one FROM "friendships" WHERE "friendships"."user_id" = $1 AND "friendships"."friend_id" IN ($2, $3, $4) LIMIT $5  [["user_id", 1], ["friend_id", 1], ["friend_id", 2], ["friend_id", 3], ["LIMIT", 1]]